FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/НапоминаниеОЗаписиНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НапоминаниеОЗаписиНаРемонт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументSMS</Name>
					<Comment>Сообщение для отправки</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.SMS</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапланированнойОтправки</Name>
					<Comment>Время отправки смс</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРемонта</Name>
					<Comment>Дата, на которую назначен ремонт</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРеальнойОтправки</Name>
					<Comment>Дата реальной отправки смс</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРемонт</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/НапоминаниеОЗаписиНаРемонт/Ext/ManagerModule.bsl
// Процедура - Создать изменить записи из заявки на ремонт
//
// Параметры:
//  Основание	 - ДокументСсылка.ЗаявкаНаРемонт - Заявка на ремонт
//
Процедура СоздатьИзменитьИзЗаявкиНаРемонт(Основание) Экспорт 
	
	// Вычислим время отправки
	ВремяОтправки = Основание.ДатаНачала - Основание.ВидРемонта.ОтправлятьЗаВремя*60*60;
	
	// Если время отправки прошло, то все равно отправим смс
	Если ВремяОтправки < ТекущаяДата() Тогда
		ВремяОтправки = ТекущаяДата(); 		
	КонецЕсли;
	
	// Создадим набор
	Запись = СоздатьНаборЗаписей();
	// Удалим старые записи
	Запись.Отбор.ЗаявкаНаРемонт.Установить(Основание);	
	Запись.Очистить();
	// Добавим новую
	НоваяЗапись = Запись.Добавить();
	НоваяЗапись.ЗаявкаНаРемонт = Основание;
	НоваяЗапись.ДатаЗапланированнойОтправки = ВремяОтправки;	
	НоваяЗапись.ДатаНачалаРемонта = Основание.ДатаНачала;
	// Запишем
	Запись.Записать();
	
КонецПроцедуры

// Процедура - Удалить из заявки на ремонт
//
// Параметры:
//  Основание	 - ДокументСсылка.ЗаявкаНаРемонт - Заявка на ремонт
//
Процедура УдалитьИзЗаявкиНаРемонт(Основание) Экспорт 
	
	Запись = СоздатьНаборЗаписей();
	Запись.Отбор.ЗаявкаНаРемонт.Установить(Основание);	
	Запись.Записать();
	
КонецПроцедуры

// Процедура - Изменить после отправки из рег задания
//
// Параметры:
//  Основание	 - ДокументСсылка.ЗаявкаНаРемонт - Заявка на ремонт
//  ДокументСМС	 - ДокументСсылка.SMS			 - Документ, созданый в регламентном задании.
//
Процедура ИзменитьПослеОтправкиИзРегЗадания(Основание, ДокументСМС) Экспорт 
	
	Запись = СоздатьНаборЗаписей();
	Запись.Отбор.ЗаявкаНаРемонт.Установить(Основание);	
	Запись.Прочитать();
	Для каждого ТекЗапись Из Запись Цикл
		ТекЗапись.ДокументSMS = ДокументСМС;
		ТекЗапись.ДатаРеальнойОтправки = ДокументСМС.НачалоОтправки;
	КонецЦикла;
	Запись.Записать();

КонецПроцедуры
